wrk2/baseline/10KB/wrk-wlan0-rep07.log
Running 30s test @ https://bench-eth2.netdev-lab.org/10k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 210.613ms, rate sampling interval: 1144ms
  Thread calibration: mean lat.: 244.800ms, rate sampling interval: 1320ms
  Thread calibration: mean lat.: 282.633ms, rate sampling interval: 1554ms
  Thread calibration: mean lat.: 304.942ms, rate sampling interval: 1601ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   294.61ms  358.88ms   2.57s    85.64%
    Req/Sec     1.24k   112.33     1.49k    71.43%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  177.28ms
 75.000%  431.10ms
 90.000%  788.48ms
 99.000%    1.60s 
 99.900%    2.09s 
 99.990%    2.49s 
 99.999%    2.56s 
100.000%    2.57s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.606     0.000000            1         1.00
       4.139     0.100000         9843         1.11
       5.839     0.200000        19677         1.25
      15.575     0.300000        29505         1.43
     107.839     0.400000        39347         1.67
     177.279     0.500000        49183         2.00
     207.743     0.550000        54093         2.22
     246.527     0.600000        59010         2.50
     301.055     0.650000        63938         2.86
     360.191     0.700000        68849         3.33
     431.103     0.750000        73776         4.00
     474.879     0.775000        76222         4.44
     522.495     0.800000        78681         5.00
     575.999     0.825000        81156         5.71
     636.927     0.850000        83601         6.67
     706.559     0.875000        86070         8.00
     745.471     0.887500        87293         8.89
     788.479     0.900000        88515        10.00
     837.631     0.912500        89751        11.43
     893.439     0.925000        90980        13.33
     962.047     0.937500        92205        16.00
    1000.959     0.943750        92819        17.78
    1044.479     0.950000        93441        20.00
    1095.679     0.956250        94049        22.86
    1150.975     0.962500        94671        26.67
    1212.415     0.968750        95282        32.00
    1247.231     0.971875        95586        35.56
    1285.119     0.975000        95897        40.00
    1332.223     0.978125        96202        45.71
    1390.591     0.981250        96509        53.33
    1457.151     0.984375        96816        64.00
    1495.039     0.985938        96970        71.11
    1530.879     0.987500        97125        80.00
    1570.815     0.989062        97277        91.43
    1616.895     0.990625        97429       106.67
    1668.095     0.992188        97582       128.00
    1692.671     0.992969        97659       142.22
    1720.319     0.993750        97741       160.00
    1746.943     0.994531        97813       182.86
    1779.711     0.995313        97889       213.33
    1814.527     0.996094        97966       256.00
    1836.031     0.996484        98007       284.44
    1857.535     0.996875        98046       320.00
    1885.183     0.997266        98083       365.71
    1918.975     0.997656        98121       426.67
    1956.863     0.998047        98159       512.00
    1974.271     0.998242        98179       568.89
    1994.751     0.998437        98198       640.00
    2023.423     0.998633        98217       731.43
    2056.191     0.998828        98236       853.33
    2093.055     0.999023        98254      1024.00
    2115.583     0.999121        98264      1137.78
    2142.207     0.999219        98274      1280.00
    2181.119     0.999316        98283      1462.86
    2230.271     0.999414        98294      1706.67
    2260.991     0.999512        98302      2048.00
    2287.615     0.999561        98307      2275.56
    2326.527     0.999609        98312      2560.00
    2361.343     0.999658        98318      2925.71
    2379.775     0.999707        98322      3413.33
    2398.207     0.999756        98326      4096.00
    2416.639     0.999780        98329      4551.11
    2426.879     0.999805        98331      5120.00
    2453.503     0.999829        98334      5851.43
    2467.839     0.999854        98336      6826.67
    2482.175     0.999878        98338      8192.00
    2494.463     0.999890        98340      9102.22
    2502.655     0.999902        98341     10240.00
    2504.703     0.999915        98342     11702.86
    2516.991     0.999927        98343     13653.33
    2519.039     0.999939        98344     16384.00
    2533.375     0.999945        98346     18204.44
    2533.375     0.999951        98346     20480.00
    2533.375     0.999957        98346     23405.71
    2543.615     0.999963        98347     27306.67
    2543.615     0.999969        98347     32768.00
    2549.759     0.999973        98348     36408.89
    2549.759     0.999976        98348     40960.00
    2549.759     0.999979        98348     46811.43
    2555.903     0.999982        98349     54613.33
    2555.903     0.999985        98349     65536.00
    2555.903     0.999986        98349     72817.78
    2555.903     0.999988        98349     81920.00
    2555.903     0.999989        98349     93622.86
    2570.239     0.999991        98350    109226.67
    2570.239     1.000000        98350          inf
#[Mean    =      294.606, StdDeviation   =      358.876]
#[Max     =     2568.192, Total count    =        98350]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  144292 requests in 30.00s, 1.41GB read
Requests/sec:   4808.95
Transfer/sec:     48.14MB