wrk2/baseline/10KB/wrk-wlan0-rep09.log
Running 30s test @ https://bench-eth2.netdev-lab.org/10k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 183.986ms, rate sampling interval: 1031ms
  Thread calibration: mean lat.: 185.219ms, rate sampling interval: 1062ms
  Thread calibration: mean lat.: 170.483ms, rate sampling interval: 997ms
  Thread calibration: mean lat.: 232.124ms, rate sampling interval: 1261ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   273.04ms  317.61ms   2.18s    84.96%
    Req/Sec     1.22k   124.51     1.58k    71.83%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  174.85ms
 75.000%  413.18ms
 90.000%  726.53ms
 99.000%    1.36s 
 99.900%    1.83s 
 99.990%    2.10s 
 99.999%    2.17s 
100.000%    2.19s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.632     0.000000            1         1.00
       4.047     0.100000         9697         1.11
       5.583     0.200000        19373         1.25
      13.103     0.300000        29053         1.43
     103.871     0.400000        38746         1.67
     174.847     0.500000        48442         2.00
     204.543     0.550000        53270         2.22
     241.407     0.600000        58112         2.50
     295.167     0.650000        62960         2.86
     351.231     0.700000        67801         3.33
     413.183     0.750000        72637         4.00
     450.815     0.775000        75053         4.44
     493.567     0.800000        77489         5.00
     538.623     0.825000        79897         5.71
     591.871     0.850000        82326         6.67
     653.823     0.875000        84750         8.00
     688.639     0.887500        85949         8.89
     726.527     0.900000        87176        10.00
     767.487     0.912500        88377        11.43
     812.543     0.925000        89583        13.33
     864.767     0.937500        90789        16.00
     893.439     0.943750        91400        17.78
     926.207     0.950000        92000        20.00
     963.583     0.956250        92605        22.86
    1006.591     0.962500        93211        26.67
    1055.743     0.968750        93817        32.00
    1083.391     0.971875        94121        35.56
    1114.111     0.975000        94423        40.00
    1148.927     0.978125        94729        45.71
    1187.839     0.981250        95032        53.33
    1233.919     0.984375        95331        64.00
    1262.591     0.985938        95480        71.11
    1298.431     0.987500        95634        80.00
    1335.295     0.989062        95782        91.43
    1376.255     0.990625        95934       106.67
    1419.263     0.992188        96087       128.00
    1441.791     0.992969        96164       142.22
    1465.343     0.993750        96237       160.00
    1495.039     0.994531        96312       182.86
    1530.879     0.995313        96390       213.33
    1568.767     0.996094        96465       256.00
    1587.199     0.996484        96501       284.44
    1616.895     0.996875        96539       320.00
    1654.783     0.997266        96577       365.71
    1691.647     0.997656        96616       426.67
    1722.367     0.998047        96652       512.00
    1740.799     0.998242        96671       568.89
    1760.255     0.998437        96690       640.00
    1779.711     0.998633        96709       731.43
    1800.191     0.998828        96728       853.33
    1827.839     0.999023        96747      1024.00
    1842.175     0.999121        96756      1137.78
    1859.583     0.999219        96766      1280.00
    1874.943     0.999316        96775      1462.86
    1902.591     0.999414        96785      1706.67
    1935.359     0.999512        96794      2048.00
    1952.767     0.999561        96799      2275.56
    1974.271     0.999609        96804      2560.00
    1988.607     0.999658        96808      2925.71
    2010.111     0.999707        96815      3413.33
    2027.519     0.999756        96818      4096.00
    2042.879     0.999780        96820      4551.11
    2060.287     0.999805        96823      5120.00
    2064.383     0.999829        96825      5851.43
    2080.767     0.999854        96827      6826.67
    2099.199     0.999878        96831      8192.00
    2099.199     0.999890        96831      9102.22
    2109.439     0.999902        96832     10240.00
    2115.583     0.999915        96833     11702.86
    2117.631     0.999927        96834     13653.33
    2134.015     0.999939        96836     16384.00
    2134.015     0.999945        96836     18204.44
    2142.207     0.999951        96837     20480.00
    2142.207     0.999957        96837     23405.71
    2150.399     0.999963        96838     27306.67
    2158.591     0.999969        96839     32768.00
    2158.591     0.999973        96839     36408.89
    2158.591     0.999976        96839     40960.00
    2158.591     0.999979        96839     46811.43
    2168.831     0.999982        96840     54613.33
    2168.831     0.999985        96840     65536.00
    2168.831     0.999986        96840     72817.78
    2168.831     0.999988        96840     81920.00
    2168.831     0.999989        96840     93622.86
    2185.215     0.999991        96841    109226.67
    2185.215     1.000000        96841          inf
#[Mean    =      273.038, StdDeviation   =      317.613]
#[Max     =     2183.168, Total count    =        96841]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  143720 requests in 30.00s, 1.40GB read
Requests/sec:   4790.55
Transfer/sec:     47.95MB